У цьому домашньому завданні ми будемо працювати з набором даних Tips. Нижче інформація про нього.

**Про датасет:**

Tips - це датасет, який містить інформацію про рахунки та чайові в ресторані.

**Колонки датасету:**
- `total_bill` - загальна сума рахунку (долари)
- `tip` - розмір чайових (долари)
- `sex` - стать відвідувача (Male/Female)
- `smoker` - чи курить (Yes/No)
- `day` - день тижня (Thur/Fri/Sat/Sun)
- `time` - час відвідування (Lunch/Dinner)
- `size` - розмір групи (кількість людей)

**Джерело:** Оригінальні дані зібрані в одному з американських ресторанів у 1990-х роках. Скачати і переглянути набір даних можна тут: https://www.kaggle.com/datasets/sakshisatre/tips-dataset

А також ми вже вивантажили файл з даними і завантажили вам у Матеріали до цього модуля.




**1. Завантаження та огляд**

Завантажте датасет Tips (Чайові) з файла у матеріалах `tips.csv`.

Виведіть (кожен пункт оцінюється в 0.5 бала):
- Перші 5 рядків
- Розмір датасету (shape)
- Назви всіх колонок
- Інформацію про типи даних (info)

In [1]:
import pandas as pd
df = pd.read_csv(r'D:\ml_course\Модуль 0. Основи Python for Data Science\DataFrames\tips.csv')
print('Перші 5 рядків:')
display(df.head())
print('Розмір датасету (shape):')
display(df.shape)
print('Назви всіх колонок:')
display(df.columns)
print('Інформацію про типи даних (info):')
display(df.info())

Перші 5 рядків:

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Розмір датасету (shape):

(244, 7)

Назви всіх колонок:

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

Інформацію про типи даних (info):
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

None

**2. Базова вибірка даних**

Виберіть та виведіть (кожен пункт оцінюється в 0.5 бала):
- Колонку `total_bill` (загальний рахунок)
- Колонки `total_bill` та `tip` (чайові) разом
- Перші 10 рядків
- Рядок з індексом 5

In [2]:
total_bill = df["total_bill"]
print(f"Загальний рахунок: \n{total_bill}")

Загальний рахунок:
0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [3]:
selected = df[["total_bill", "tip"]]
print(f"Загальний рахунок та чайові: \n{selected}")

Загальний рахунок та чайові:
     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [4]:
print(f"Перші 10 рядків: \n{df.iloc[0:10]}")

Перші 10 рядків:
   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [5]:
print(f'Рядок з індексом 5: \n{df.iloc[5]}')

Рядок з індексом 5:
total_bill     25.29
tip             4.71
sex             Male
smoker            No
day              Sun
time          Dinner
size               4
Name: 5, dtype: object

**3. Фільтрація даних**

Відфільтруйте та виведіть (кожен пункт оцінюється в 0.5 бала):
- Всі рахунки більше 20 доларів (`total_bill > 20`)
- Всі відвідувачі-жінки (`sex == 'Female'`)
- Рахунки на вечерю (`time == 'Dinner'`)
- Рахунки на вечерю більше 30 доларів

In [49]:
print("Рахунки > 20")
df[(df['total_bill'] > 20)][['total_bill']]

Рахунки > 20

     total_bill
2         21.01
3         23.68
4         24.59
5         25.29
7         26.88
..          ...
237       32.83
238       35.83
239       29.03
240       27.18
241       22.67

[97 rows x 1 columns]

In [41]:
print("Відвідувачі-жінки")
df[(df['sex'] == 'Female')][['sex']]

Відвідувачі-жінки

        sex
0    Female
4    Female
11   Female
14   Female
16   Female
..      ...
226  Female
229  Female
238  Female
240  Female
243  Female

[87 rows x 1 columns]

In [39]:
print("Рахунки на Dinner")
df[(df['time'] == 'Dinner')][['time']]

Рахунки на Dinner

       time
0    Dinner
1    Dinner
2    Dinner
3    Dinner
4    Dinner
..      ...
239  Dinner
240  Dinner
241  Dinner
242  Dinner
243  Dinner

[176 rows x 1 columns]

In [48]:
print("Dinner > 30")
df[(df['time'] == 'Dinner') & (df['total_bill'] > 30)][['time', 'total_bill']].head()

Dinner > 30

      time  total_bill
11  Dinner       35.26
23  Dinner       39.42
39  Dinner       31.27
44  Dinner       30.40
47  Dinner       32.40

---

**4. Статистика**

Обчисліть (кожен пункт оцінюється в 0.5 бала):
- Середній розмір рахунку на всьому наборі даних
- Максимальні чайові
- Кількість пропущених значень у всіх колонках
- Скільки відвідувачів обідали, скільки вечеряли

In [54]:
print("Середній розмір рахунку")
df.total_bill.mean()

Середній розмір рахунку

np.float64(19.78594262295082)

In [55]:
print("Максимальні чайові")
df.tip.max()

Максимальні чайові

np.float64(10.0)

In [64]:
print("Кількість пропущених значень")
df.isnull().sum()

Кількість пропущених значень

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [65]:
print("Скільки відвідувачів обідали, скільки вечеряли")
df.time.value_counts()

Скільки відвідувачів обідали, скільки вечеряли

time
Dinner    176
Lunch      68
Name: count, dtype: int64

---

**5. Групування**

Обчисліть (кожен пункт оцінюється в 0.5 бала):
- Середній рахунок за статтю (groupby `sex`)
- Середні чайові за днем тижня (groupby `day`)
- Скільки відвідувачів у кожен день

In [ ]:
by_class = df.groupby('sex')['total_bill'].mean()
print('Середній рахунок за статтю')
by_class

Середній рахунок за статтю (groupby `sex`)

sex
Female    18.056897
Male      20.744076
Name: total_bill, dtype: float64

In [67]:
by_day = df.groupby('day')['tip'].mean()
print('Середні чайові за днем тижня')
by_day

Середні чайові за днем тижня

day
Fri     2.734737
Sat     2.993103
Sun     3.255132
Thur    2.771452
Name: tip, dtype: float64

In [78]:
every_day = df.groupby('day')['size'].sum()
print('Скільки відвідувачів у кожен день')
every_day

Скільки відвідувачів у кожен день

day
Fri      40
Sat     219
Sun     216
Thur    152
Name: size, dtype: int64

---

**6. Створення нової колонки**

Створіть нову колонку `tip_percentage` - відсоток чайових від загальної суми рахунку.
Виведіть перші 10 рядків з новою колонкою.

In [88]:
df['tip_percentage'] = (df['tip'] / df['total_bill'] * 100).round(2)
df.head(10)

   total_bill   tip     sex smoker  day    time  size  tip_percentage
0       16.99  1.01  Female     No  Sun  Dinner     2            5.94
1       10.34  1.66    Male     No  Sun  Dinner     3           16.05
2       21.01  3.50    Male     No  Sun  Dinner     3           16.66
3       23.68  3.31    Male     No  Sun  Dinner     2           13.98
4       24.59  3.61  Female     No  Sun  Dinner     4           14.68
5       25.29  4.71    Male     No  Sun  Dinner     4           18.62
6        8.77  2.00    Male     No  Sun  Dinner     2           22.81
7       26.88  3.12    Male     No  Sun  Dinner     4           11.61
8       15.04  1.96    Male     No  Sun  Dinner     2           13.03
9       14.78  3.23    Male     No  Sun  Dinner     2           21.85

---

**7. Сортування**

Відсортуйте датасет і виведіть результат сортування в кожному випадку окремо (кожен пункт оцінюється в 0.5 бала):
- За розміром рахунку (зростання)
- За чайовими (спадання)

Додатково виведіть топ-5 найбільших чайових використовуючи метод `nlargest`.

In [ ]:
df_sorted_total = df.sort_values('total_bill')
df_sorted_total.head()

     total_bill   tip     sex smoker   day    time  size  tip_percentage
67         3.07  1.00  Female    Yes   Sat  Dinner     1           32.57
92         5.75  1.00  Female    Yes   Fri  Dinner     2           17.39
111        7.25  1.00  Female     No   Sat  Dinner     1           13.79
172        7.25  5.15    Male    Yes   Sun  Dinner     2           71.03
149        7.51  2.00    Male     No  Thur   Lunch     2           26.63

In [93]:
df_sorted_tip = df.sort_values('tip', ascending=False)
df_sorted_tip.head()

     total_bill    tip   sex smoker   day    time  size  tip_percentage
170       50.81  10.00  Male    Yes   Sat  Dinner     3           19.68
212       48.33   9.00  Male     No   Sat  Dinner     4           18.62
23        39.42   7.58  Male     No   Sat  Dinner     4           19.23
59        48.27   6.73  Male     No   Sat  Dinner     4           13.94
141       34.30   6.70  Male     No  Thur   Lunch     6           19.53

In [95]:
top_tips = df.nlargest(5, 'tip')
top_tips

     total_bill    tip   sex smoker   day    time  size  tip_percentage
170       50.81  10.00  Male    Yes   Sat  Dinner     3           19.68
212       48.33   9.00  Male     No   Sat  Dinner     4           18.62
23        39.42   7.58  Male     No   Sat  Dinner     4           19.23
59        48.27   6.73  Male     No   Sat  Dinner     4           13.94
141       34.30   6.70  Male     No  Thur   Lunch     6           19.53